ProgrammingInJava/Multithreaded_programming.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-11 Fri 20:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Multithreaded Programming</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="looph0le" />
</head>
<body>
<div id="content">
<h1 class="title">Multithreaded Programming</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc7cceac">1. Introduction</a></li>
<li><a href="#org21f9eae">2. Difference Between Multitasking Treads And Multitasking Processes.</a>
<ul>
<li><a href="#org489425b">2.1. Multitasking processes</a></li>
<li><a href="#orgad7ff12">2.2. Multitasking threads</a></li>
</ul>
</li>
<li><a href="#org61b5830">3. Thread Priorities</a></li>
<li><a href="#orgbb8b120">4. Synchronization</a></li>
<li><a href="#orge5d4dfa">5. Messaging</a></li>
<li><a href="#orgebb698d">6. The Thread Class</a></li>
<li><a href="#orgdcae13e">7. Main Thread</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc7cceac" class="outline-2">
<h2 id="orgc7cceac"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Unlike many other programming languages, Java provides built-in support for multithreaded programming. A multithreaded program contains two or more parts that can run concurrently(simultaneously).
Each part of such program is called a <b>thread</b>, and each thread defines a separate part of execution.
</p>


<p>
Thus, multithreading is a specialized form of multitasking. There are two distinct types of multitasking -
</p>


<p>
Process-based and thread-based.
</p>


<p>
Process-based multitasking is the feature that allows your computer to run two or more programs concurrently. For example, process-based multitasking enables you to run the java compiler at the same time that you are using a text editor. In process based multitasking, a program is the smallest unit of code that can be dispatched by the scheduler.
</p>


<p>
In a thread-based multitasking environment, the thread is the smallest unit of dispatchable code. This means that a single program can perform two or more tasks simultaneously. For instance, a text editor can formate text at the same time that it is printing, as long as these two actions are being performed by two separate threads.
</p>
</div>
</div>

<div id="outline-container-org21f9eae" class="outline-2">
<h2 id="org21f9eae"><span class="section-number-2">2</span> Difference Between Multitasking Treads And Multitasking Processes.</h2>
<div class="outline-text-2" id="text-2">
<p>
Multitasking threads require less overhead than multitasking processes.
</p>
</div>
<div id="outline-container-org489425b" class="outline-3">
<h3 id="org489425b"><span class="section-number-3">2.1</span> Multitasking processes</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Processes are heavyweight tasks that require their own separate address spaces. Interprocess communication is expensive and limited. Context switching from one process to another is also costly.
</p>
</div>
</div>
<div id="outline-container-orgad7ff12" class="outline-3">
<h3 id="orgad7ff12"><span class="section-number-3">2.2</span> Multitasking threads</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Threads, on the other hand, are lightweight. They share the same address space and cooperatively share the same heavyweight process. Interthread communication is inexpensive, and context switching from one thread to the next is low
</p>
</div>
</div>
</div>

<div id="outline-container-org61b5830" class="outline-2">
<h2 id="org61b5830"><span class="section-number-2">3</span> Thread Priorities</h2>
<div class="outline-text-2" id="text-3">
<p>
Java assigns to each thread a priority that determines how that thread should be treated with respect to the others. Thread priorities are integers that specify the relative priority of one thread to another. As an absoulte value, a priority is meaningless; a higher-priority thread doesn't run any faster than a lower-priority thread if it is the only thread running. Instead, a thread's priority is used to decide when to switch from one running thread to the next. This is called a <b>context switch</b>.
</p>


<p>
The rules that determine when a context switch takes place are simple:
</p>
<ul class="org-ul">
<li>A thread can voluntarily relinquish control. This is done by explicitly yielding, sleeping, or blocking on pending I/O. In this scenario, all other threads are examined, and the highest-priority thread that is ready to run is given the CPU.</li>
<li>A thread can be preempted by a higher-priority thread. In this case, a lower-priority thread that does not yield the processor is simple preempted&#x2013;no matter what it is doing&#x2013;by a higher-priority thread. Basically, as soon as a higher-priority thread wants to run, it does. This is called <b>preemptive multitasking</b>.</li>
</ul>

<p>
In case where two threads with the same priority are competing for CPU cycles, the situation is a bit complicated.
</p>


<p>
For operating systems such as Windows, threads of equal priority are time-sliced automatically in round-robin fashion. For other types of operating systems, threads of equal priority must voluntarily yield control to their peers. If they don't, the other threads will not run.
</p>
</div>
</div>

<div id="outline-container-orgbb8b120" class="outline-2">
<h2 id="orgbb8b120"><span class="section-number-2">4</span> Synchronization</h2>
<div class="outline-text-2" id="text-4">
<p>
Because multithreading introduces an asynchronous behavior to your program, there must be a way for you to enfore synchronicity when you need it.
For example, if you want two threads to communicate and share a complicated data structure, such as a linked list, you need some way to ensure that they don't conflict with each other. That is, you must prevent one thread from writing data while another thread is in the middle of reading it. For this purpose, Java implements an elegant twist on an age-old model for interprocess synchronization: the <b>monitor</b>.
</p>


<p>
The Monitor is a control mechanism. You can think of a monitor as a very small box that can hold only <i>one thread</i>. Once a thread enters a monitor, all other threads must wait until that thread exits the monitor. In this way, a monitor can be used to protect a shared asset from being used manipulated by more than one thread at a time.
Most multithreaded systems expose monitors as objects that your program must explicitly acquire and manipulate. Java provides a cleaner solutions. There is no class "Monitor"; instead, each object has its own implicit monitor that is automatically entered when one of the objects's synchronized methods is called. Once a thread is inside a synchronized method, no other thread can call any other synchronized method on the same object. This enables you to write very clean and concise multithreaded code, because synchronization support in built into the language.
</p>
</div>
</div>

<div id="outline-container-orge5d4dfa" class="outline-2">
<h2 id="orge5d4dfa"><span class="section-number-2">5</span> Messaging</h2>
<div class="outline-text-2" id="text-5">
<p>
After you divide your program into separate threads, you need to define how they will communicate with each other. When programming with most other languages, you must depend on the operating system to establish communication between threads. This, of course, adds overhead. By contrast, Java provides a clean, low-cost way for two or more threads to talk to each other, via calls to predefined methods that all objects have. Java's messaging system allows a thread to enter a synchronized method on an object, and then wait there until some other thread explicitly notifies it to come out.
</p>
</div>
</div>

<div id="outline-container-orgebb698d" class="outline-2">
<h2 id="orgebb698d"><span class="section-number-2">6</span> The Thread Class</h2>
<div class="outline-text-2" id="text-6">
<p>
Java's multithreading system is built upon the <b>Thread class</b>, its method,and its companion interface, <b>Runnable</b>.
</p>
</div>
</div>

<div id="outline-container-orgdcae13e" class="outline-2">
<h2 id="orgdcae13e"><span class="section-number-2">7</span> Main Thread</h2>
<div class="outline-text-2" id="text-7">
<p>
When a java program starts up, one thread begins running immediately. This is usually called the <i>main thread</i> of your program, because it is one that is executed when your program begins. The main thread is important because:
</p>
<ul class="org-ul">
<li>It is the thread from which other "child" threads will be spawned.</li>
<li>Often, it must be the last thread to finish execution because it performs various shutdown actions.</li>
</ul>

<p>
Although the main thread is created automatically when your program is started, it can be controlled through a <b>Thread</b> object. To do so you must obtain a reference to it by called the method currentThread(), which is a public static member of Thread.
</p>

<div class="org-src-container">
<pre class="src src-java">static Thread currentThread()
</pre>
</div>

<p>
This method returns reference to the thread in which it is called. Once you have a reference to the main method, you can control it just like any thread.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: looph0le</p>
<p class="date">Created: 2022-03-11 Fri 20:55</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
